## Caso COVID-19 Fase 1
Julián Correa, Guillermo Cortés, Cristian Sarmiento

### Preprocesarmiento de información

In [14]:
## import libraries and dependencies
import pandas as pd

## read downloaded csv file
df = pd.read_csv('time_series_covid19_confirmed_global.csv')
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,2/28/23,3/1/23,3/2/23,3/3/23,3/4/23,3/5/23,3/6/23,3/7/23,3/8/23,3/9/23
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,209322,209340,209358,209362,209369,209390,209406,209436,209451,209451
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,334391,334408,334408,334427,334427,334427,334427,334427,334443,334457
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,271441,271448,271463,271469,271469,271477,271477,271490,271494,271496
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,47866,47875,47875,47875,47875,47875,47875,47875,47890,47890
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,105255,105277,105277,105277,105277,105277,105277,105277,105288,105288

In [16]:
## melt dataframe to get dates
id_vars = ['Province/State', 'Country/Region', 'Lat', 'Long']
df = df.melt(id_vars=id_vars, var_name='date')
df.head()

  Province/State Country/Region       Lat       Long     date  value
0            NaN    Afghanistan  33.93911  67.709953  1/22/20      0
1            NaN        Albania  41.15330  20.168300  1/22/20      0
2            NaN        Algeria  28.03390   1.659600  1/22/20      0
3            NaN        Andorra  42.50630   1.521800  1/22/20      0
4            NaN         Angola -11.20270  17.873900  1/22/20      0

In [19]:
## Transform date column to datetime format
df['date'] = pd.to_datetime(df['date'], format='%m/%d/%y')
df.head()

  Province/State Country/Region       Lat       Long       date  value
0            NaN    Afghanistan  33.93911  67.709953 2020-01-22      0
1            NaN        Albania  41.15330  20.168300 2020-01-22      0
2            NaN        Algeria  28.03390   1.659600 2020-01-22      0
3            NaN        Andorra  42.50630   1.521800 2020-01-22      0
4            NaN         Angola -11.20270  17.873900 2020-01-22      0

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330327 entries, 0 to 330326
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Province/State  104013 non-null  object
 1   Country/Region  330327 non-null  object
 2   Lat             328041 non-null  float64
 3   Long            328041 non-null  float64
 4   date            330327 non-null  datetime64[ns]
 5   value           330327 non-null  int64
 6   month           330327 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 17.6+ MB

#### 1. ¿En cuál mes se presentó el mayor número de contagios?

In [45]:
df['month'] = df['date'].apply(lambda x: x.month)
df_agg_month = df.groupby('month', as_index=False).agg({'value':'sum'})
df_agg_month

    month        value
0       1  33869092391
1       2  33492334705
2       3  24250662950
3       4  19376072310
4       5  21396059685
5       6  21720865286
6       7  23771381760
7       8  25495268336
8       9  26041150426
9      10  28075660109
10     11  28409680750
11     12  31012067611

In [40]:
df_agg_month[df_agg_month['value'] == df_agg_month['value'].max()]

   month        value
0      1  33869092391

#### 2. ¿En ese mismo mes, cuál fue el país que reportó más contagios?

In [47]:
max_month = 1
cond = (df['month'] == max_month)
df_country = df[cond].groupby('Country/Region', as_index=False).agg({'value':'sum'})

df_country[df_country['value'] == df_country['value'].max()]

    Country/Region       value
186             US  5934153125

#### 3. ¿Cuál es el país con el menor número de casos reportados hasta la fecha?

In [57]:
df_min_country = df.groupby('Country/Region', as_index=False).agg({'value':'sum'})
df_min_country[(df_min_country['value'] == df_min_country['value'].min())]

   Country/Region  value
93   Korea, North    300

***
___